src/test/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://task.are.moe/UserService">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:ListAllUsersRequest />
   </soapenv:Body>
</soapenv:Envelope>